data/raw/gpu_load_control/llama/background_logs/llama_bgload_c64i256o256_probeconc4_main_run1_conc64.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x71772fb90fe0>, trust_remote_code=False, seed=0, num_prompts=40, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='meta-llama/Llama-3.1-8B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['role=background_load', 'label=c64i256o256_probeconc4_main_run1', 'iteration=1'], result_dir='./fixd_load_control_runs/llama/background_logs/iterations', result_filename='llama_bgload_c64i256o256_probeconc4_main_run1_conc64_iter1.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-44157126-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-26 12:24:58 [datasets.py:631] Sampling input_len from [255, 255] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 40/40 [00:07<00:00,  5.47it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  7.31      
Total input tokens:                      10200     
Total generated tokens:                  10240     
Request throughput (req/s):              5.47      
Output token throughput (tok/s):         1400.62   
Peak output token throughput (tok/s):    1480.00   
Peak concurrent requests:                40.00     
Total token throughput (tok/s):          2795.77   
---------------Time to First Token----------------
Mean TTFT (ms):                          130.62    
Median TTFT (ms):                        132.95    
P99 TTFT (ms):                           136.70    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.13     
Median TPOT (ms):                        28.13     
P99 TPOT (ms):                           28.13     
---------------Inter-token Latency----------------
Mean ITL (ms):                           28.02     
Median ITL (ms):                         28.13     
P99 ITL (ms):                            30.02     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f9ed3194fe0>, trust_remote_code=False, seed=0, num_prompts=40, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='meta-llama/Llama-3.1-8B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['role=background_load', 'label=c64i256o256_probeconc4_main_run1', 'iteration=2'], result_dir='./fixd_load_control_runs/llama/background_logs/iterations', result_filename='llama_bgload_c64i256o256_probeconc4_main_run1_conc64_iter2.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-5bcc853d-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-26 12:25:14 [datasets.py:631] Sampling input_len from [255, 255] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 40/40 [00:07<00:00,  5.26it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  7.60      
Total input tokens:                      10200     
Total generated tokens:                  10240     
Request throughput (req/s):              5.26      
Output token throughput (tok/s):         1347.03   
Peak output token throughput (tok/s):    1400.00   
Peak concurrent requests:                40.00     
Total token throughput (tok/s):          2688.79   
---------------Time to First Token----------------
Mean TTFT (ms):                          128.23    
Median TTFT (ms):                        130.02    
P99 TTFT (ms):                           133.33    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.28     
Median TPOT (ms):                        29.28     
P99 TPOT (ms):                           29.29     
---------------Inter-token Latency----------------
Mean ITL (ms):                           29.17     
Median ITL (ms):                         29.16     
P99 ITL (ms):                            39.57     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x753781b90fe0>, trust_remote_code=False, seed=0, num_prompts=40, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='meta-llama/Llama-3.1-8B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['role=background_load', 'label=c64i256o256_probeconc4_main_run1', 'iteration=3'], result_dir='./fixd_load_control_runs/llama/background_logs/iterations', result_filename='llama_bgload_c64i256o256_probeconc4_main_run1_conc64_iter3.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-1333df9b-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-26 12:25:29 [datasets.py:631] Sampling input_len from [255, 255] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 40/40 [00:07<00:00,  5.46it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  7.32      
Total input tokens:                      10200     
Total generated tokens:                  10240     
Request throughput (req/s):              5.46      
Output token throughput (tok/s):         1398.33   
Peak output token throughput (tok/s):    1480.00   
Peak concurrent requests:                40.00     
Total token throughput (tok/s):          2791.20   
---------------Time to First Token----------------
Mean TTFT (ms):                          131.71    
Median TTFT (ms):                        133.69    
P99 TTFT (ms):                           137.48    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.17     
Median TPOT (ms):                        28.17     
P99 TPOT (ms):                           28.18     
---------------Inter-token Latency----------------
Mean ITL (ms):                           28.06     
Median ITL (ms):                         28.19     
P99 ITL (ms):                            29.52     
==================================================